* Some experiments to see if we can use maxima to generate input to JK


* $ad(x_1, x_2, x_3); x_i in [0,5]$
#+BEGIN_SRC maxima :session :results raw replace drawer
  m: [
    y\(1\,0\) + y\(1\,1\) + y\(1\,2\) + y\(1\,3\) + y\(1\,4\) + y\(1\,5\) = 1,
    y\(2\,0\) + y\(2\,1\) + y\(2\,2\) + y\(2\,3\) + y\(2\,4\) + y\(2\,5\) = 1,
    y\(3\,0\) + y\(3\,1\) + y\(3\,2\) + y\(3\,3\) + y\(3\,4\) + y\(3\,5\) = 1,
   y\(1\,1\) +2*y\(1\,2\) +3*y\(1\,3\) +4*y\(1\,4\) +5*y\(1\,5\)-x1 = 0,
   y\(2\,1\) +2*y\(2\,2\) +3*y\(2\,3\) +4*y\(2\,4\) +5*y\(2\,5\)-x2 = 0,
   y\(3\,1\) +2*y\(3\,2\) +3*y\(3\,3\) +4*y\(3\,4\) +5*y\(3\,5\)-x3 = 0,
   y\(1\,0\) + y\(2\,0\) + y\(3\,0\) <= 1,
   y\(1\,1\) + y\(2\,1\) + y\(3\,1\) <= 1,
   y\(1\,2\) + y\(2\,2\) + y\(3\,2\) <= 1,
   y\(1\,3\) + y\(2\,3\) + y\(3\,3\) <= 1,
   y\(1\,4\) + y\(2\,4\) + y\(3\,4\) <= 1,
   y\(1\,5\) + y\(2\,5\) + y\(3\,5\) <= 1,
  y\(1\,0\) >= 0,
  y\(1\,1\) >= 0,
  y\(1\,2\) >= 0,
  y\(1\,3\) >= 0,
  y\(1\,4\) >= 0,
  y\(1\,5\) >= 0,
  y\(2\,0\) >= 0,
  y\(2\,1\) >= 0,
  y\(2\,2\) >= 0,
  y\(2\,3\) >= 0,
  y\(2\,4\) >= 0,
  y\(2\,5\) >= 0,
  y\(3\,0\) >= 0,
  y\(3\,1\) >= 0,
  y\(3\,2\) >= 0,
  y\(3\,3\) >= 0,
  y\(3\,4\) >= 0,
  y\(3\,5\) >= 0
  ]$

  /* Above: the model in x and y */
  nbx:3;
  /* Eliminate one y variable per equality */
  for i: 1 thru nbx do
    for j: 1 step -1 thru 0 do
      (
      v:second(sort(listofvars(m[1]))),
print(v),
      e:solve(m[1], v),
print("Substitute this in"),
print(e),
      m:ev(m,e),
      m:rest(m),
print(m)
      );

  /* Construct the conic combination of all inequalities left as the objective */
  leftside:0;
  rightside:0;
  lambdas:makelist();
  for i: 1 thru length(m) do
    (
    push(l(i),lambdas),
print("***"),
print(m[i]),
    leftside: leftside + l(i)*lhs(m[i]),
    rightside: rightside + l(i)*rhs(m[i])
  );
  objective: expand(leftside-rightside);
  print(objective);
  vars:sort(listofvars(objective));
print("vars");
print(vars);
  /* Extract the coefficient of each y to set it to zero */
  M:makelist();
  for i: nbx+1 thru length(vars) do
    push(coeff(objective,vars[i],1)=0,M);
print(M);
  /* Substitute the vanishing equalities into the objective */
  objective:ev(objective,M);
  objective:ratsimp(objective);
  objective:expand(ev(objective,M));
  print(objective);
  /* Print the coefficients of the lambdas. Each one is a polynomial in x */
  lambdas:sort(lambdas);
  %print(lambdas);
  %print(coeff(objective,lambdas[2],1));
  for i: 1 thru length(lambdas) do
  (
    p:coeff(objective,lambdas[i],1),
    c:makelist(),
    push(coeff(p,var[1],0),c),
    for j: nbx thru 1 step -1 do
    (
      push(coeff(p,vars[j],1),c)
      ),
    printf(true,"~a ", c)
    );
  printf(true,"~&");


  /* The default print is ugly. We will make it nicer */
  M:coefmatrix(M,lambdas);
  for i: 1 thru length(M) do
    (
    for j: 1 thru length(M[1]) do 
      printf(true,"~3d",M[i,j]),
    printf(true," = 0 ~&")
  );
  /* The normalizing equality, all lambdas must sum to one */
  for i: 1 thru length(lambdas) do printf(true, "~3d", 1);
  printf(true," = 1~&");
#+END_SRC

#+RESULTS:
:RESULTS:
y(1,1) 
Substitute this in 
[y(1,1) = (- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1] 
[y(2,5) + y(2,4) + y(2,3) + y(2,2) + y(2,1) + y(2,0) = 1, 
y(3,5) + y(3,4) + y(3,3) + y(3,2) + y(3,1) + y(3,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
5 y(2,5) + 4 y(2,4) + 3 y(2,3) + 2 y(2,2) + y(2,1) - x2 = 0, 
5 y(3,5) + 4 y(3,4) + 3 y(3,3) + 2 y(3,2) + y(3,1) - x3 = 0, 
y(3,0) + y(2,0) + y(1,0) <= 1, y(3,1) + y(2,1) - y(1,5) - y(1,4) - y(1,3)
 - y(1,2) - y(1,0) + 1 <= 1, y(3,2) + y(2,2) + y(1,2) <= 1, 
y(3,3) + y(2,3) + y(1,3) <= 1, y(3,4) + y(2,4) + y(1,4) <= 1, 
y(3,5) + y(2,5) + y(1,5) <= 1, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, y(2,1) >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, y(3,1) >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
y(2,1) 
Substitute this in 
[y(2,1) = (- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1] 
[y(3,5) + y(3,4) + y(3,3) + y(3,2) + y(3,1) + y(3,0) = 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
5 y(3,5) + 4 y(3,4) + 3 y(3,3) + 2 y(3,2) + y(3,1) - x3 = 0, 
y(3,0) + y(2,0) + y(1,0) <= 1, y(3,1) - y(2,5) - y(2,4) - y(2,3) - y(2,2)
 - y(2,0) - y(1,5) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 2 <= 1, 
y(3,2) + y(2,2) + y(1,2) <= 1, y(3,3) + y(2,3) + y(1,3) <= 1, 
y(3,4) + y(2,4) + y(1,4) <= 1, y(3,5) + y(2,5) + y(1,5) <= 1, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, y(3,1) >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
y(3,1) 
Substitute this in 
[y(3,1) = (- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1] 
[4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - y(1,0) - x1 + 1 = 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
y(3,0) + y(2,0) + y(1,0) <= 1, (- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0)
 - y(2,5) - y(2,4) - y(2,3) - y(2,2) - y(2,0) - y(1,5) - y(1,4) - y(1,3)
 - y(1,2) - y(1,0) + 3 <= 1, y(3,2) + y(2,2) + y(1,2) <= 1, 
y(3,3) + y(2,3) + y(1,3) <= 1, y(3,4) + y(2,4) + y(1,4) <= 1, 
y(3,5) + y(2,5) + y(1,5) <= 1, y(1,0) >= 0, 
(- y(1,5)) - y(1,4) - y(1,3) - y(1,2) - y(1,0) + 1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
y(1,0) 
Substitute this in 
[y(1,0) = 4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1] 
[4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - y(2,0) - x2 + 1 = 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
y(3,0) + y(2,0) + 4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 <= 1, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) - y(2,5) - y(2,4) - y(2,3)
 - y(2,2) - y(2,0) - 5 y(1,5) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 + 2 <= 1, 
y(3,2) + y(2,2) + y(1,2) <= 1, y(3,3) + y(2,3) + y(1,3) <= 1, 
y(3,4) + y(2,4) + y(1,4) <= 1, y(3,5) + y(2,5) + y(1,5) <= 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, y(2,0) >= 0, 
(- y(2,5)) - y(2,4) - y(2,3) - y(2,2) - y(2,0) + 1 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
y(2,0) 
Substitute this in 
[y(2,0) = 4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1] 
[4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - y(3,0) - x3 + 1 = 0, 
y(3,0) + 4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) + 4 y(1,5) + 3 y(1,4)
 + 2 y(1,3) + y(1,2) - x2 - x1 + 2 <= 1, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) - 5 y(2,5) - 4 y(2,4) - 3 y(2,3)
 - 2 y(2,2) - 5 y(1,5) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x2 + x1 + 1 <= 1, 
y(3,2) + y(2,2) + y(1,2) <= 1, y(3,3) + y(2,3) + y(1,3) <= 1, 
y(3,4) + y(2,4) + y(1,4) <= 1, y(3,5) + y(2,5) + y(1,5) <= 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, y(3,0) >= 0, 
(- y(3,5)) - y(3,4) - y(3,3) - y(3,2) - y(3,0) + 1 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
y(3,0) 
Substitute this in 
[y(3,0) = 4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1] 
[4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) + 4 y(2,5) + 3 y(2,4) + 2 y(2,3)
 + y(2,2) + 4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x3 - x2 - x1 + 3 <= 1, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) - 5 y(2,5) - 4 y(2,4) - 3 y(2,3)
 - 2 y(2,2) - 5 y(1,5) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x3 + x2 + x1 <= 1, 
y(3,2) + y(2,2) + y(1,2) <= 1, y(3,3) + y(2,3) + y(1,3) <= 1, 
y(3,4) + y(2,4) + y(1,4) <= 1, y(3,5) + y(2,5) + y(1,5) <= 1, 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0, 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0, y(1,2) >= 0, 
y(1,3) >= 0, y(1,4) >= 0, y(1,5) >= 0, 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0, 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0, y(2,2) >= 0, 
y(2,3) >= 0, y(2,4) >= 0, y(2,5) >= 0, 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0, 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0, y(3,2) >= 0, 
y(3,3) >= 0, y(3,4) >= 0, y(3,5) >= 0] 
*** 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) + 4 y(2,5) + 3 y(2,4) + 2 y(2,3)
    + y(2,2) + 4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x3 - x2 - x1 + 3 <= 1 
*** 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) - 5 y(2,5) - 4 y(2,4) - 3 y(2,3)
    - 2 y(2,2) - 5 y(1,5) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x3 + x2 + x1 <= 1 
*** 
y(3,2) + y(2,2) + y(1,2) <= 1 
*** 
y(3,3) + y(2,3) + y(1,3) <= 1 
*** 
y(3,4) + y(2,4) + y(1,4) <= 1 
*** 
y(3,5) + y(2,5) + y(1,5) <= 1 
*** 
4 y(1,5) + 3 y(1,4) + 2 y(1,3) + y(1,2) - x1 + 1 >= 0 
*** 
(- 5 y(1,5)) - 4 y(1,4) - 3 y(1,3) - 2 y(1,2) + x1 >= 0 
*** 
y(1,2) >= 0 
*** 
y(1,3) >= 0 
*** 
y(1,4) >= 0 
*** 
y(1,5) >= 0 
*** 
4 y(2,5) + 3 y(2,4) + 2 y(2,3) + y(2,2) - x2 + 1 >= 0 
*** 
(- 5 y(2,5)) - 4 y(2,4) - 3 y(2,3) - 2 y(2,2) + x2 >= 0 
*** 
y(2,2) >= 0 
*** 
y(2,3) >= 0 
*** 
y(2,4) >= 0 
*** 
y(2,5) >= 0 
*** 
4 y(3,5) + 3 y(3,4) + 2 y(3,3) + y(3,2) - x3 + 1 >= 0 
*** 
(- 5 y(3,5)) - 4 y(3,4) - 3 y(3,3) - 2 y(3,2) + x3 >= 0 
*** 
y(3,2) >= 0 
*** 
y(3,3) >= 0 
*** 
y(3,4) >= 0 
*** 
y(3,5) >= 0 
l(24) y(3,5) - 5 l(20) y(3,5) + 4 l(19) y(3,5) + l(6) y(3,5) - 5 l(2) y(3,5)
 + 4 l(1) y(3,5) + l(23) y(3,4) - 4 l(20) y(3,4) + 3 l(19) y(3,4) + l(5) y(3,4)
 - 4 l(2) y(3,4) + 3 l(1) y(3,4) + l(22) y(3,3) - 3 l(20) y(3,3)
 + 2 l(19) y(3,3) + l(4) y(3,3) - 3 l(2) y(3,3) + 2 l(1) y(3,3) + l(21) y(3,2)
 - 2 l(20) y(3,2) + l(19) y(3,2) + l(3) y(3,2) - 2 l(2) y(3,2) + l(1) y(3,2)
 + l(18) y(2,5) - 5 l(14) y(2,5) + 4 l(13) y(2,5) + l(6) y(2,5) - 5 l(2) y(2,5)
 + 4 l(1) y(2,5) + l(17) y(2,4) - 4 l(14) y(2,4) + 3 l(13) y(2,4) + l(5) y(2,4)
 - 4 l(2) y(2,4) + 3 l(1) y(2,4) + l(16) y(2,3) - 3 l(14) y(2,3)
 + 2 l(13) y(2,3) + l(4) y(2,3) - 3 l(2) y(2,3) + 2 l(1) y(2,3) + l(15) y(2,2)
 - 2 l(14) y(2,2) + l(13) y(2,2) + l(3) y(2,2) - 2 l(2) y(2,2) + l(1) y(2,2)
 + l(12) y(1,5) - 5 l(8) y(1,5) + 4 l(7) y(1,5) + l(6) y(1,5) - 5 l(2) y(1,5)
 + 4 l(1) y(1,5) + l(11) y(1,4) - 4 l(8) y(1,4) + 3 l(7) y(1,4) + l(5) y(1,4)
 - 4 l(2) y(1,4) + 3 l(1) y(1,4) + l(10) y(1,3) - 3 l(8) y(1,3) + 2 l(7) y(1,3)
 + l(4) y(1,3) - 3 l(2) y(1,3) + 2 l(1) y(1,3) + l(9) y(1,2) - 2 l(8) y(1,2)
 + l(7) y(1,2) + l(3) y(1,2) - 2 l(2) y(1,2) + l(1) y(1,2) + l(20) x3
 - l(19) x3 + l(2) x3 - l(1) x3 + l(14) x2 - l(13) x2 + l(2) x2 - l(1) x2
 + l(8) x1 - l(7) x1 + l(2) x1 - l(1) x1 + l(19) + l(13) + l(7) - l(6) - l(5)
 - l(4) - l(3) - l(2) + 2 l(1) 
vars 
[x1, x2, x3, y(1,2), y(1,3), y(1,4), y(1,5), y(2,2), y(2,3), y(2,4), y(2,5), 
                                               y(3,2), y(3,3), y(3,4), y(3,5)] 
[l(24) - 5 l(20) + 4 l(19) + l(6) - 5 l(2) + 4 l(1) = 0, 
l(23) - 4 l(20) + 3 l(19) + l(5) - 4 l(2) + 3 l(1) = 0, 
l(22) - 3 l(20) + 2 l(19) + l(4) - 3 l(2) + 2 l(1) = 0, 
l(21) - 2 l(20) + l(19) + l(3) - 2 l(2) + l(1) = 0, 
l(18) - 5 l(14) + 4 l(13) + l(6) - 5 l(2) + 4 l(1) = 0, 
l(17) - 4 l(14) + 3 l(13) + l(5) - 4 l(2) + 3 l(1) = 0, 
l(16) - 3 l(14) + 2 l(13) + l(4) - 3 l(2) + 2 l(1) = 0, 
l(15) - 2 l(14) + l(13) + l(3) - 2 l(2) + l(1) = 0, 
l(12) - 5 l(8) + 4 l(7) + l(6) - 5 l(2) + 4 l(1) = 0, 
l(11) - 4 l(8) + 3 l(7) + l(5) - 4 l(2) + 3 l(1) = 0, 
l(10) - 3 l(8) + 2 l(7) + l(4) - 3 l(2) + 2 l(1) = 0, 
l(9) - 2 l(8) + l(7) + l(3) - 2 l(2) + l(1) = 0] 
l(20) x3 - l(19) x3 + l(2) x3 - l(1) x3 + l(14) x2 - l(13) x2 + l(2) x2
 - l(1) x2 + l(8) x1 - l(7) x1 + l(2) x1 - l(1) x1 + l(19) + l(13) + l(7)
 - l(6) - l(5) - l(4) - l(3) - l(2) + 2 l(1) 
[-1,-1,-1,(-x3)-x2-x1+2] [1,1,1,x3+x2+x1-1] [0,0,0,-1] [0,0,0,-1] [0,0,0,-1] [0,0,0,-1] [-1,0,0,1-x1] [1,0,0,x1] [0,0,0,0] [0,0,0,0] [0,0,0,0] [0,0,0,0] [0,-1,0,1-x2] [0,1,0,x2] [0,0,0,0] [0,0,0,0] [0,0,0,0] [0,0,0,0] [0,0,-1,1-x3] [0,0,1,x3] [0,0,0,0] [0,0,0,0] [0,0,0,0] [0,0,0,0] 
  4 -5  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  4 -5  0  0  0  1 = 0 
  3 -4  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  3 -4  0  0  1  0 = 0 
  2 -3  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  2 -3  0  1  0  0 = 0 
  1 -2  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1 -2  1  0  0  0 = 0 
  4 -5  0  0  0  1  0  0  0  0  0  0  4 -5  0  0  0  1  0  0  0  0  0  0 = 0 
  3 -4  0  0  1  0  0  0  0  0  0  0  3 -4  0  0  1  0  0  0  0  0  0  0 = 0 
  2 -3  0  1  0  0  0  0  0  0  0  0  2 -3  0  1  0  0  0  0  0  0  0  0 = 0 
  1 -2  1  0  0  0  0  0  0  0  0  0  1 -2  1  0  0  0  0  0  0  0  0  0 = 0 
  4 -5  0  0  0  1  4 -5  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0 = 0 
  3 -4  0  0  1  0  3 -4  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0 = 0 
  2 -3  0  1  0  0  2 -3  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0 = 0 
  1 -2  1  0  0  0  1 -2  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 = 0 
  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 = 1
:END:
